Repository: nelicic/Sequel
Catalog: Properties/Resources.*.resx
Languages: uk

source: Account
uk: Обліковий запис

source: Achievements
uk: Досягнення

# aliases
source: SQL aliases are used to give a table, or a column in a table, a temporary name. Aliases are often used to make column names more readable. An alias only exists for the duration of that query. An alias is created with the AS keyword.
uk: Псевдоніми SQL використовуються для надання таблиці або стовпця в таблиці тимчасового імені. Псевдоніми часто використовуються, щоб зробити імена стовпців більш читабельними. Псевдонім існує лише на час виконання цього запиту. Псевдонім створюється за допомогою ключового слова AS.

# andornot
source: The WHERE clause can be combined with AND, OR, and NOT operators. The AND and OR operators are used to filter records based on more than one condition. The NOT operator displays a record if the condition(s) is NOT TRUE.
uk: Оператор WHERE можна поєднувати з операторами AND, OR та NOT. Оператори І та АБО використовуються для фільтрації записів на основі кількох умов. Оператор NOT відображає запис, якщо умова(и) НЕ ІСТИНА.

# anyall
source: The ANY and ALL operators allow you to perform a comparison between a single column value and a range of other values. The ANY operator: returns a boolean value as a result returns TRUE if ANY of the subquery values meet the condition ANY means that the condition will be true if the operation is true for any of the values in the range. The ALL operator: returns a boolean value as a result returns TRUE if ALL of the subquery values meet the condition is used with SELECT, WHERE and HAVING statements ALL means that the condition will be true only if the operation is true for all values in the range.
uk: Оператори ANY та ALL дозволяють виконувати порівняння між значенням одного стовпця та діапазоном інших значень. ANY оператор: в результаті повертає логічне значення повертає TRUE, якщо ANY із значень підзапиту відповідає умові ANY означає, що умова буде істинною, якщо операція істинна для будь-якого зі значень у діапазоні. Оператор ALL: в результаті повертає логічне значення повертає TRUE, якщо УСІ значення підзапиту відповідають умові використовується з операторами SELECT, WHERE і HAVING ALL означає, що умова буде істинною, лише якщо операція істинна для всіх значень у діапазоні.

# between
source: The BETWEEN operator selects values within a given range. The values can be numbers, text, or dates. The BETWEEN operator is inclusive: begin and end values are included.
uk: Оператор BETWEEN вибирає значення в межах заданого діапазону. Значеннями можуть бути числа, текст або дати. Оператор BETWEEN включає в себе значення початку та кінця.

# case
source: The CASE statement goes through conditions and returns a value when the first condition is met (like an if-then-else statement). So, once a condition is true, it will stop reading and return the result. If no conditions are true, it returns the value in the ELSE clause. If there is no ELSE part and no conditions are true, it returns NULL.
uk: Оператор CASE проходить через умови і повертає значення, коли виконується перша умова (наприклад, оператор if-then-else). Отже, як тільки умова буде істинною, вона припинить читання та поверне результат. Якщо жодні умови не відповідають дійсності, він повертає значення в пропозиції ELSE. Якщо немає частини ELSE і жодних умов не відповідає дійсності, він повертає NULL.

source: Constructor
uk: Конструктор

# delete
source: The DELETE statement is used to delete existing records in a table. Note: Be careful when deleting records in a table! Notice the WHERE clause in the DELETE statement. The WHERE clause specifies which record(s) should be deleted. If you omit the WHERE clause, all records in the table will be deleted! It is possible to delete all rows in a table without deleting the table. This means that the table structure, attributes, and indexes will be intact
uk: Оператор DELETE використовується для видалення наявних записів у таблиці. Примітка. Будьте обережні, видаляючи записи в таблиці! Зверніть увагу на оператор WHERE в операторі DELETE. Оператор WHERE вказує, які записи(и) слід видалити. Якщо ви пропустите оператор WHERE, усі записи в таблиці будуть видалені! Можна видалити всі рядки в таблиці, не видаляючи таблицю. Це означає, що структура таблиці, атрибути та індекси залишаться незмінними

# distinct
source: The SELECT DISTINCT statement is used to return only distinct (different) values. Inside a table, a column often contains many duplicate values; and sometimes you only want to list the different (distinct) values.
uk: Оператор SELECT DISTINCT використовується для повернення лише різних (різних) значень. Усередині таблиці стовпець часто містить багато повторюваних значень; а іноді вам потрібно лише перерахувати різні (розрізнені) значення.

# exist
source: The EXISTS operator is used to test for the existence of any record in a subquery. The EXISTS operator returns TRUE if the subquery returns one or more records.
uk: Оператор EXISTS використовується для перевірки наявності будь-якого запису в підзапиті. Оператор EXISTS повертає TRUE, якщо підзапит повертає один або кілька записів.

# from
source: The FROM command is used to specify which table to select or delete data from. The following SQL statement selects the "CustomerName" and "City" columns from the "Customers" table:
uk: Оператор FROM використовується, щоб вказати, яку таблицю вибрати або видалити дані. Наступний оператор SQL вибирає стовпці "CustomerName" і "City" з таблиці "Customers":

# full
source: The FULL OUTER JOIN keyword returns all records when there is a match in left (table1) or right (table2) table records. Tip: FULL OUTER JOIN and FULL JOIN are the same.
uk: Ключове слово FULL OUTER JOIN повертає всі записи, якщо є відповідність у лівих (таблиця1) або правих (таблиця2) записах таблиці. Порада: FULL OUTER JOIN і FULL JOIN - те саме.

# functions
source: The COUNT() function returns the number of rows that matches a specified criterion. The AVG() function returns the average value of a numeric column. The SUM() function returns the total sum of a numeric column.
uk: Функція COUNT() повертає кількість рядків, яка відповідає заданому критерію. Функція AVG() повертає середнє значення числового стовпця. Функція SUM() повертає загальну суму числового стовпця.

# groupby
source: The GROUP BY statement groups rows that have the same values into summary rows, like "find the number of customers in each country". The GROUP BY statement is often used with aggregate functions (COUNT(), MAX(), MIN(), SUM(), AVG()) to group the result-set by one or more columns.
uk: Оператор GROUP BY групує рядки з однаковими значеннями в підсумкові рядки, наприклад "знайти кількість клієнтів у кожній країні". Оператор GROUP BY часто використовується з агрегатними функціями (COUNT(), MAX(), MIN(), SUM(), AVG()) для групування набору результатів за одним або кількома стовпцями.

source: Guide
uk: Гайд

# having
source: The HAVING clause was added to SQL because the WHERE keyword cannot be used with aggregate functions.
uk: Оператор HAVING було додано до SQL, оскільки ключове слово WHERE не можна використовувати з агрегатними функціями.

source: Home
uk: Головна сторінка

# in
source: The IN operator allows you to specify multiple values in a WHERE clause. The IN operator is a shorthand for multiple OR conditions.
uk: Оператор IN дозволяє вказати кілька значень у операторі WHERE. Оператор IN – це скорочення для кількох умов АБО.

# inner
source: The INNER JOIN keyword selects records that have matching values in both tables.
uk: Ключове слово INNER JOIN вибирає записи, які мають відповідні значення в обох таблицях.

# insertinto
source: The INSERT INTO statement is used to insert new records in a table. It is possible to write the INSERT INTO statement in two ways: 1. Specify both the column names and the values to be inserted. 2. If you are adding values for all the columns of the table, you do not need to specify the column names in the SQL query. However, make sure the order of the values is in the same order as the columns in the table. Here, the INSERT INTO syntax would be as follows:
uk: Оператор INSERT INTO використовується для вставки нових записів у таблицю. Записати оператор INSERT INTO можна двома способами: 1. Вкажіть імена стовпців і значення, які потрібно вставити. 2. Якщо ви додаєте значення для всіх стовпців таблиці, вам не потрібно вказувати імена стовпців у запиті SQL. Однак переконайтеся, що порядок значень відповідає порядку стовпців у таблиці. Тут синтаксис INSERT INTO буде таким:

# join
source: A JOIN clause is used to combine rows from two or more tables, based on a related column between them. (INNER) JOIN: Returns records that have matching values in both tables LEFT (OUTER) JOIN: Returns all records from the left table, and the matched records from the right table RIGHT (OUTER) JOIN: Returns all records from the right table, and the matched records from the left table FULL (OUTER) JOIN: Returns all records when there is a match in either left or right table
uk: Речення JOIN використовується для об’єднання рядків з двох або більше таблиць на основі пов’язаного стовпця між ними. (INNER) JOIN: повертає записи, які мають відповідні значення в обох таблицях ЛІВЕ (ЗОВНІШНЄ) ПРИЄДНАННЯ: повертає всі записи з лівої таблиці та відповідні записи з правої таблиці ПРАВО (ЗОВНІШНЄ) ПРИЄДНАННЯ: повертає всі записи з правої таблиці та відповідні записи з лівої таблиці ПОВНЕ (ЗОВНІШНЄ) ПРИЄДНАННЯ: повертає всі записи, якщо є збіг у лівій або правій таблиці

# left
source: The LEFT JOIN keyword returns all records from the left table (table1), and the matching records from the right table (table2). The result is 0 records from the right side, if there is no match.
uk: Ключове слово LEFT JOIN повертає всі записи з лівої таблиці (таблиця1) і відповідні записи з правої таблиці (таблиця2). Результатом буде 0 записів з правого боку, якщо немає відповідності.

# like
source: The LIKE operator is used in a WHERE clause to search for a specified pattern in a column. There are two wildcards often used in conjunction with the LIKE operator: The percent sign (%) represents zero, one, or multiple characters The underscore sign (_) represents one, single character
uk: Оператор LIKE використовується в оператор WHERE для пошуку вказаного шаблону в стовпці. Є два символи підстановки, які часто використовуються разом з оператором LIKE: Знак відсотка (%) означає нуль, один або кілька символів Знак підкреслення (_) позначає один, один символ

# limit
source: The LIMIT clause is used to specify the number of records to return. The LIMIT clause is useful on large tables with thousands of records. Returning a large number of records can impact performance.
uk: Оператор LIMIT використовується для визначення кількості записів, які повертаються. Оператор LIMIT корисно для великих таблиць з тисячами записів. Повернення великої кількості записів може вплинути на продуктивність.

# lvl
source: Levels
uk: Рівні

# lvlconstructor
source: Level Constructor
uk: Конструктор рівнів

# minmax
source: The MIN() function returns the smallest value of the selected column. The MAX() function returns the largest value of the selected column.
uk: Функція MIN() повертає найменше значення вибраного стовпця. Функція MAX() повертає найбільше значення вибраного стовпця.

# null
source: A field with a NULL value is a field with no value. If a field in a table is optional, it is possible to insert a new record or update a record without adding a value to this field. Then, the field will be saved with a NULL value. Note: A NULL value is different from a zero value or a field that contains spaces. A field with a NULL value is one that has been left blank during record creation!
uk: Поле зі значенням NULL – це поле без значення. Якщо поле в таблиці необов’язкове, можна вставити новий запис або оновити запис без додавання значення до цього поля. Потім поле буде збережено зі значенням NULL. Примітка: значення NULL відрізняється від нульового значення або поля, яке містить пробіли. Поле зі значенням NULL – це поле, яке було залишено порожнім під час створення запису!

# orderby
source: The ORDER BY keyword is used to sort the result-set in ascending or descending order. The ORDER BY keyword sorts the records in ascending order by default(ASC). To sort the records in descending order, use the DESC keyword.
uk: Ключове слово ORDER BY використовується для сортування набору результатів у порядку зростання або спадання. Ключове слово ORDER BY сортує записи в порядку зростання за замовчуванням (ASC). Щоб відсортувати записи в порядку спадання, використовуйте ключове слово DESC.

# right
source: The RIGHT JOIN keyword returns all records from the right table (table2), and the matching records from the left table (table1). The result is 0 records from the left side, if there is no match.
uk: Ключове слово RIGHT JOIN повертає всі записи з правої таблиці (таблиця2) і відповідні записи з лівої таблиці (таблиця1). Результатом є 0 записів з лівого боку, якщо немає збігу.

source: Sandbox
uk: Пісочниця

# select
source: The SELECT statement is used to select data from a database. The data returned is stored in a result table, called the result-set.
uk: Оператор SELECT використовується для вибору даних з бази даних. Повернені дані зберігаються в таблиці результатів, яка називається набір результатів.

# self
source: A self join is a regular join, but the table is joined with itself. T1 and T2 are different table aliases for the same table.
uk: Самооб’єднання – це звичайне з’єднання, але таблиця об’єднується сама з собою. T1 і T2 – різні псевдоніми таблиць для однієї таблиці.

source: Settings
uk: Налаштування

# union
source: The UNION operator is used to combine the result-set of two or more SELECT statements. Every SELECT statement within UNION must have the same number of columns The columns must also have similar data types The columns in every SELECT statement must also be in the same order The UNION operator selects only distinct values by default. To allow duplicate values, use UNION ALL.
uk: Оператор UNION використовується для поєднання набору результатів з двох або більше операторів SELECT. Кожен оператор SELECT в UNION повинен мати однакову кількість стовпців Стовпці також повинні мати подібні типи даних Стовпці в кожній інструкції SELECT також мають бути в одному порядку Оператор UNION за замовчуванням вибирає лише різні значення. Щоб дозволити повторювані значення, використовуйте UNION ALL.

# update
source: The UPDATE statement is used to modify the existing records in a table. Note: Be careful when updating records in a table! Notice the WHERE clause in the UPDATE statement. The WHERE clause specifies which record(s) that should be updated. If you omit the WHERE clause, all records in the table will be updated!
uk: Оператор UPDATE використовується для зміни наявних записів у таблиці. Примітка. Будьте обережні під час оновлення записів у таблиці! Зверніть увагу на оператор WHERE в операторі UPDATE. Оператор WHERE вказує, які записи(и) потрібно оновити. Якщо ви пропустите оператор WHERE, усі записи в таблиці будуть оновлені!

# where
source: The WHERE clause is used to filter records. It is used to extract only those records that fulfill a specified condition. Operators: =, >, <, >=, <=, <>, BETWEEN - Between a certain range, LIKE - Search for a pattern, IN - To specify multiple possible values for a column
uk: Оператор WHERE використовується для фільтрації записів. Він використовується для вилучення лише тих записів, які відповідають заданій умові. Оператори: =, >, <, >=, <=, <>, BETWEEN - Між певним діапазоном, LIKE - Пошук шаблону, IN - Щоб вказати декілька можливих значень для стовпця
